src/cf/InformationRegisters/ХодОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ХодОбработки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторПункта</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РезультатыВыполненияДействий</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбработкиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.РабочиеГруппы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Действия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторУчастника</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипСобытияХодаОбработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Функция</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФункцииУчастниковДействий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МоментВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ХодОбработки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Структура события.
// 
// Возвращаемое значение:
//  Структура - Структура события:
// * Обработка - СправочникСсылка.ОбработкиОбъектов
// * Описание - Строка
// * ТипСобытия - ПеречислениеСсылка.ТипСобытияХодаОбработки 
// * Действие - ОпределяемыйТип.Действия
// * Участник - СправочникСсылка.Сотрудники,СправочникСсылка.СтруктураПредприятия,СправочникСсылка.РабочиеГруппы,Строка,СправочникСсылка.ПолныеРоли,СправочникСсылка.Пользователи
// * Функция - ОпределяемыйТип.ФункцииУчастниковДействий
// * Результат - ОпределяемыйТип.РезультатыВыполненияДействий
// * ИдентификаторПункта - УникальныйИдентификатор
// * ФактическийИсполнитель - 
// * Поручение - ДокументСсылка.Задача
// * ИдентификаторУчастника - УникальныйИдентификатор
// * Сотрудник - СправочникСсылка.Сотрудники,СправочникСсылка.Пользователи
Функция СтруктураСобытия() Экспорт
	
	Возврат Новый Структура("Обработка, 
	|Описание, 
	|ТипСобытия, 
	|Действие, 
	|Участник, 
	|Функция,
	|Результат,
	|ИдентификаторПункта,
	|ФактическийИсполнитель,
	|Поручение,
	|ИдентификаторУчастника,
	|Сотрудник,
	|ОписаниеПункта");
	
КонецФункции	

// Добавляет описание события в ход обработки
// 
// Параметры:
//  Событие - см. СтруктураСобытия
//
Процедура ЗаписатьСобытие(Событие) Экспорт
	
	Если Не ЗначениеЗаполнено(Событие.Обработка) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Событие);
	
	МенеджерЗаписи.Дата = ТекущаяДатаСеанса();
	МенеджерЗаписи.МоментВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Если Не ЗначениеЗаполнено(МенеджерЗаписи.Сотрудник) Тогда
		ОлицетворяемыйСотрудник = Сотрудники.ОсновнойСотрудникПользователя(
			ПользователиДокументооборот.ОлицетворяемыйПользователь());
		МенеджерЗаписи.Сотрудник = ОлицетворяемыйСотрудник;
	КонецЕсли;

	Если ЗначениеЗаполнено(Событие.ОписаниеПункта) Тогда
		МенеджерЗаписи.Описание = МенеджерЗаписи.Описание + " " 
			+ НСтр("ru = 'Пункт: '") + Событие.ОписаниеПункта;
	КонецЕсли;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
